Ran Plan for dir: `environment/test` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.kms.aws_kms_key.this[0] has changed
~ resource "aws_kms_key" "this" {
        id                                 = "6e411100-b970-4f95-8e84-cdbbcaf77104"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::895976263444:role/my-eks-cluster-cluster-20250615060512722000000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:ListAliases",
                          + "kms:GetKeyPolicy",
                          + "kms:GetKeyRotationStatus",
                          + "kms:ListResourceTags",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::895976263444:role/atlantis-irsa-role"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowAtlantisIRSAKeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment" = "production"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.atlantis_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "atlantis_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:default:atlantis-new",
                ]
              + variable = "oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.eks_admin_assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_admin_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_iam_openid_connect_provider.oidc must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc" {
      ~ arn             = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70" -> (known after apply)
      ~ id              = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70" -> (known after apply)
      - tags            = {
          - "Environment" = "production"
          - "Name"        = "my-eks-cluster-eks-irsa"
        } -> null
      ~ tags_all        = {
          - "Environment" = "production"
          - "Name"        = "my-eks-cluster-eks-irsa"
        } -> (known after apply)
      ~ thumbprint_list = [
          ~ "06b25927c42a721631c1efd9431e648fa62e1e39" -> "9e99a48a9960b14926bb7f3b02e22da0cbed5e11",
        ]
      ~ url             = "oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70" -> "https://oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.atlantis_irsa_role will be updated in-place
~ resource "aws_iam_role" "atlantis_irsa_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70:sub" = "system:serviceaccount:default:atlantis-new"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "atlantis-irsa-role"
        name                  = "atlantis-irsa-role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_iam_role.eks_admin will be updated in-place
~ resource "aws_iam_role" "eks_admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-admin"
        name                  = "eks-admin"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # helm_release.atlantis-new will be updated in-place
~ resource "helm_release" "atlantis-new" {
        id                         = "atlantis-new"
      ~ metadata                   = [
          - {
              - app_version    = "v0.34.0"
              - chart          = "atlantis"
              - first_deployed = 1749971625
              - last_deployed  = 1749977181
              - name           = "atlantis-new"
              - namespace      = "default"
              - notes          = <<-EOT
                    1. Get the application URL by running these commands:
                    2. Atlantis will not start successfully unless at least one of the following sets of credentials are specified (see values.yaml for detailed usage):
                      - github
                      - githubApp
                      - gitea
                      - gitlab
                      - bitbucket
                EOT
              - revision       = 4
              - values         = jsonencode(
                    {
                      - atlantisUrl    = "http://aa0a94120fa8844e187fcfb39f84328e-259313376.eu-central-1.elb.amazonaws.com"
                      - github         = {
                          - secret = "d9f7a3b1e8c54f72a6d8e9b3c1f0a7d4e5b6c7d8"
                          - token  = "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"
                          - user   = "shwetaec12"
                        }
                      - orgAllowlist   = "github.com/shwetaec12/eks-atlantis-demo"
                      - repoConfig     = <<-EOT
                            repos:
                              - id: github.com/shwetaec12/eks-atlantis-demo
                        EOT
                      - service        = {
                          - type = "LoadBalancer"
                        }
                      - serviceAccount = {
                          - create = false
                          - name   = "atlantis-new"
                        }
                      - volumeClaim    = {
                          - storageClassName = "gp3-immediate"
                        }
                    }
                )
              - version        = "5.17.2"
            },
        ] -> (known after apply)
        name                       = "atlantis-new"
      ~ values                     = [
          ~ <<-EOT
              - orgAllowlist: "github.com/shwetaec12/eks-atlantis-demo"
              + orgAllowlist: "github.com/shwetaec12/eks-atlantis-demo"
              - github:
              + github:
              -   user: "shwetaec12"
              +   user: "shwetaec12"
              -   token: "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" 
              +   token: "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" 
              -   secret: "d9f7a3b1e8c54f72a6d8e9b3c1f0a7d4e5b6c7d8"
              +   secret: "d9f7a3b1e8c54f72a6d8e9b3c1f0a7d4e5b6c7d8"
              - 
              + 
              - repoConfig: |-
              + repoConfig: |-
              -   repos:
              +   repos:
              -     - id: github.com/shwetaec12/eks-atlantis-demo
              +     - id: github.com/shwetaec12/eks-atlantis-demo
              -       
              +       
              - atlantisUrl: "http://aa0a94120fa8844e187fcfb39f84328e-259313376.eu-central-1.elb.amazonaws.com"
              + atlantisUrl: "http://a0a94120fa8844e187fcfb39f84328e-259313376.eu-central-1.elb.amazonaws.com"
              - 
              + 
              - volumeClaim:
              + volumeClaim:
              -   storageClassName: "gp3-immediate"
              +   storageClassName: "gp3-immediate"
              - 
              + 
              - service:
              + service:
              -   type: "LoadBalancer"
              +   type: "LoadBalancer"
              - 
              + 
              - # Use existing service account with IRSA role attached
              + # Use existing service account with IRSA role attached
              - serviceAccount:
              + serviceAccount:
              -   create: false
              +   create: false
                  name: "atlantis-new"
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
~ resource "aws_kms_key" "this" {
        id                                 = "6e411100-b970-4f95-8e84-cdbbcaf77104"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::895976263444:user/shwetaec12" -> "arn:aws:iam::895976263444:role/atlantis-irsa-role"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::895976263444:role/my-eks-cluster-cluster-20250615060512722000000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                  - {
                      - Action    = [
                          - "kms:DescribeKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:ListAliases",
                          - "kms:GetKeyPolicy",
                          - "kms:GetKeyRotationStatus",
                          - "kms:ListResourceTags",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::895976263444:role/atlantis-irsa-role"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowAtlantisIRSAKeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment" = "production"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_iam_role.this[0],
│   on .terraform/modules/eks/main.tf line 293, in resource "aws_iam_role" "this":
│  293: resource "aws_iam_role" "this" {
│ 
│ inline_policy is deprecated. Use the aws_iam_role_policy resource instead.
│ If Terraform should exclusively manage all inline policy associations (the
│ current behavior of this argument), use the aws_iam_role_policies_exclusive
│ resource as well.
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d environment/test
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://aa0a94120fa8844e187fcfb39f84328e-259313376.eu-central-1.elb.amazonaws.com/lock?id=shwetaec12%252Feks-atlantis-demo%252Fenvironment%252Ftest%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d environment/test
  ```

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 4 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```